In [1]:
import pandas as pd

data=pd.read_csv('p1.csv')
data

        Name  Salary Country
0      Rahul   40000   India
1       Ravi   32000     USA
2    Saurabh   45000   Italy
3     Mahesh   54000   India
4    Rishabh   72000   India
5      Rajat   62000     USA
6   Abhishek   92000   Italy
7      Jatin   55000   India
8     Gaurav   35000   Italy
9      Ritik   48000     USA
10      Mani   34000   India
11      Neha   32100     USA
12     Naman   35600   Italy
13   Pradeep   43800   Italy

In [ ]:
import numpy as np
print("Mean Salary=",np.mean(data['Salary']))

In [ ]:
print("Sum of Salary:",sum(data['Salary']))

In [ ]:
print("Maximum Salary:",max(data['Salary']))

In [ ]:
print("Minimum Salary:",min(data['Salary']))

In [ ]:
print("Total No. of Salary count:",len(data['Salary']))

In [ ]:
print("Median Salary:",np.median(data['Salary']))

In [ ]:
print("Standard Daviation:",np.std(data['Salary']))

In [ ]:
print("Total no. of rows and columns:",data.shape)

In [ ]:
print("Total Rows:",data.shape[0])
print("Total Columns:",data.shape[1])

In [2]:
new_df=pd.DataFrame([['Vishal',67000,'India']],columns=['Name','Salary','Country'])
new_df

     Name  Salary Country
0  Vishal   67000   India

In [3]:
#appending new_df into data dataframe

data=data.append(new_df,ignore_index=True)

In [ ]:
data

In [4]:
#Appending new column
data['Department']=pd.Series(['LKO','KNP','LKO','KNP','LKO','KNP','LKO','KNP','LKO','KNP','LKO','KNP','LKO','KNP'])

In [5]:
data

        Name  Salary Country Department
0      Rahul   40000   India        LKO
1       Ravi   32000     USA        KNP
2    Saurabh   45000   Italy        LKO
3     Mahesh   54000   India        KNP
4    Rishabh   72000   India        LKO
5      Rajat   62000     USA        KNP
6   Abhishek   92000   Italy        LKO
7      Jatin   55000   India        KNP
8     Gaurav   35000   Italy        LKO
9      Ritik   48000     USA        KNP
10      Mani   34000   India        LKO
11      Neha   32100     USA        KNP
12     Naman   35600   Italy        LKO
13   Pradeep   43800   Italy        KNP
14    Vishal   67000   India        NaN